Repository: Noura-sun/YUSUR
Catalog: YUSUR/Localizable.xcstrings
Source language: en
Languages: ar

source: * Use the counter after each round to avoid errors. * The progress bar shows your current and remaining steps. * You can return to this instructions page by clicking the info icon.
ar: * استخدم العداد بعد كل جولة لتجنب الأخطاء. * يعرض شريط التقدم خطواتك الحالية والمتبقية. * يمكنك العودة إلى صفحة التعليمات هذه بالنقر على أيقونة المعلومات.

source: 1. Ihram: - Read the intentions and recommended supplications. 2. Tawaf: - Use the counter to track each round. - Supplications will appear for each round. 3. Sa’i: - Track your 7 rounds between Safa and Marwah using the counter. 4. EndIhram /Shaving: - Follow the rules based on your gender.
ar: 1. الإحرام: - النية و قراءة الأدعية المستحبة. 2. الطواف : - استخدم العداد لتتبع كل جولة. - ستظهر أدعية لكل جولة. 3. السعي: - تتبع جولاتك السبعة بين الصفا والمروة باستخدام العداد. 4. التحلل من الإحرام / الحلاقة : - اتبع القواعد بناءً على جنسك.

source: **Rules of Ihram:**
ar: **أحكام الإحرام:**

source: At the designated Miqat (entry point for Ihram), declare the intention for Umrah by saying: \"Labbayk Allahumma Umrah\" (Here I am, O Allah, for Umrah).
ar: عند الميقات المخصص (نقطة دخول الإحرام) أعلن نية العمرة بالقول: "لبيك الله عمرة" (لبيك اللهم عمرة).

source: Back
ar: رجوع

source: Begin Tawaf at the Black Stone.\n Say "Bismillah, Allahu Akbar".\n If you can touch the Black Stone, do so. If not, gesture towards it while continuing Tawaf. Continue with prayers and supplications.
ar: الطواف : ابدء الطواف بالحجر الأسود قل "بسم الله، الله أكبر" إذا تمكنت من لمس الحجر الأسود، فافعل، وإذا لم يكن الأمر كذلك، فما عليك سوى الإشارة إليه أثناء الطواف، ومواصلة الصلاة والدعاء..

source: Continue
ar: استمرار

source: EndIhram
ar: التحلل من الاحرام

source: Glory be to Allah, all praise is due to Allah, there is no god but Allah, and Allah is the Greatest
ar: سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلٰهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ

source: How to use:
ar: كيفية الاستخدام:

source: Ihram
ar: الاحرام

source: Intention (Niyyah):
ar: النية

source: It is sufficient to make the intention in your heart without verbal declaration.
ar: ويكفي أن تعقد النية في قلبك دون التصريح.

source: Men
ar: رجل

source: Note:
ar: ملاحظة:

source: O Allah, I ask You for pardon and well-being in this world and the Hereafter
ar: اللهم إني أسألك العَفْوَ والعَافِيَةَ في الدنيا والآخرة.

source: O Allah, You are Pardoning and Generous, and You love to pardon, so pardon me
ar: اللهم إِنَّكَ عَفُوٌّ كَرِيمٌ، تُحِبُّ العَفْوَ فَاعْفُ عَنِّي.

source: Oh God, I ask you for Paradise, and whatever words and deeds bring me closer to it, and I seek refuge in You from Hell, and whatever words and deeds bring me closer to it.
ar: اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ وَعَمَلٍ.

source: Our Lord, give us good in this world and good in the Hereafter, and protect us from the punishment of the Fire
ar: اللهم آتنا في الدنيا حسنةً وفي الآخرة حسنةً وقنا عذاب النار

source: Sa’i
ar: السعي

source: Start Now
ar: ابدأ الآن

source: Start Tawaf
ar: ابدأ الطواف

source: Start Umrah
ar: بدء العمرة

source: Tawaf
ar: الطواف

source: We strive to provide you with a seamless experience to help you perform Umrah with ease. Please follow these instructions:
ar: نحن نسعى جاهدين لنقدم لك تجربة سلسة تساعدك على أداء العمرة بسهولة. يرجى اتباع هذه التعليمات:

source: Wear two white, unstitched garments (Izar and Rida).
ar: - ارتداء ثوبين أبيضين غير مخيطين (إزار و رداء).

# Welcome to YUSUR your Umrah Guide App!
source: Welcome to YUSUR \n your Umrah Guide App!
ar: مرحبًا بك في تطبيق دليل العمرة “يُسْر”

source: Women
ar: امرأة

source: Women should wear modest clothing that covers the body but does not include the hands.
ar: وينبغي للمرأة أن ترتدي ملابس محتشمة تغطي الجسم ولا يشمل اليدين.
